export const hydropostRivers = [
  "Днепр",
  "Березина",
  "Сож",
  "Припять",
  "Горынь",
  "Западная Двина",
  "Неман",
];

export const hydropostGroups = {
  dnepr: ["Могилев", "Жлобин", "Речица", "Лоев"],
  berezina: ["Березино", "Бобруйск", "Светлогорск"],
  soj: ["Славгород", "Гомель"],
  pripiat: ["Пинск", "Коробье", "Черничи", "Петриков", "Мозырь", "Наровля"],
  gorin: ["ст. Горынь"],
  dvina: ["Сураж", "Витебск", "Полоцк"],
  neman: ["Гродно"],
};

export const hydronodeRivers = [
  "Припять",
  "Пина",
  "Днепро-Бугский канал",
  "Мухавец",
  "Западная Двина",
  "Неман",
  "Августовский канал",
];

export const hydronodeGroups = {
  pripiat: ["Судоходный г/у №11 Качановичи", "Судоходный г/у №12 Стахово"],
  pina: ["Судоходный г/у №1 Дубой"],
  dbk: [
    "Судоходный г/у №2 Переруб",
    "Судоходный г/у №3 Рагодощ",
    "Судоходный г/у №4 Овзичи",
    "Судоходный г/у №5 Ляховичи",
    "Судоходный г/у Кобрин",
  ],
  muhavets: [
    "Судоходный г/у №8 Залузье",
    "Судоходный г/у №9 Новосады",
    "Судоходный г/у №10 Тришин",
    "Брест плотина",
  ],
  zapDvina: ["Судоходный шлюз Витебская ГЭС", "Полоцкая ГЭС"],
  neman: ["Гродненская ГЭС"],
  avgCanal: [
    "Белорусская часть г/у Кужинец",
    "Судоходный г/у Волкушек",
    "Судоходный г/у Домбровка",
    "Судоходный г/у Немново",
  ],
};

export const bridgeRivers = [
  "Днепр",
  "Березина",
  "Сож",
  "Неман",
  "Августовский канал",
  "Мухавец",
  "Днепро-Бугский канал",
  "Пина",
  "Верхний участок реки Припять",
  "Припять",
  "Западная Двина",
];

export const bridgeGroups = {
  dnepr: [
    { name: "Копысь а/д мост", kilometr: 1570.1, rsu: "-" },
    { name: "Шклов а/д мост", kilometr: 1554.8, rsu: "-" },
    { name: "Павловка МКАД а/д мост", kilometr: 1524.5, rsu: 10 },
    { name: "Могилёв ж/д мост", kilometr: 1507.6, rsu: 20.5 },
    { name: "Королёва а/д мост", kilometr: 1507, rsu: 8 },
    { name: "Днепровский а/д мост", kilometr: 1502.9, rsu: 10.5 },
    { name: "Шмидтовский а/д мост", kilometr: 1501.2, rsu: "-" },
    { name: "Новосёлки МКАД а/д мост", kilometr: 1487, rsu: 10.5 },
    { name: "Быхов а/д мост", kilometr: 1439.6, rsu: 7 },
    { name: "Рогачев а/д мост", kilometr: 1316.6, rsu: 7 },
    { name: "Жлобин а/д мост", kilometr: 1287.6, rsu: 10.5 },
    { name: "Жлобин ж/д мост", kilometr: 1281.8, rsu: 6.9 },
    { name: "Жлобин новый ж/д мост", kilometr: 1278.1, rsu: 10 },
    { name: "Речицкий ж/д мост", kilometr: 1169.8, rsu: 4.8 },
    { name: "Отверницкий (старый) а/д мост", kilometr: 1159.3, rsu: 9 },
    { name: "Отверницкий (новый) а/д мост", kilometr: 1159.3, rsu: "-" },
  ],
  berezina: [
    { name: "Елизово ж/д мост", kilometr: 223.4, rsu: "-" },
    { name: "Щатково а/д мост", kilometr: 191.8, rsu: 6.5 },
    { name: "Фандоковский а/д мост", kilometr: 174.9, rsu: 10 },
    { name: "Бобруйск а/д мост", kilometr: 172, rsu: 7 },
    { name: "Бобруйск ж/д мост", kilometr: 170, rsu: 6.28 },
    { name: "Чирковичи а/д мост", kilometr: 75.6, rsu: "-" },
    { name: "Какель ж/д мост", kilometr: 66.2, rsu: "-" },
  ],
  soj: [
    { name: "Славгородский а/д мост", kilometr: 294.6, rsu: 7 },
    { name: "Чечерский а/д мост", kilometr: 205.8, rsu: 9.1 },
    { name: "Ветковский а/д мост", kilometr: 132.7, rsu: 6.95 },
    { name: "Кленковский ж/д мост", kilometr: 112.7, rsu: 5.4 },
    { name: "Гомельский пешеходный мост", kilometr: 107, rsu: 10 },
    { name: "Гомельский а/д мост", kilometr: 105.4, rsu: 5.3 },
    { name: "Гомельский а/д мост (старый)", kilometr: 105.4, rsu: 5.3 },
    { name: "Гомельский ж/д мост", kilometr: 105.1, rsu: 5.4 },
    { name: "Новобелицкий а/д мост", kilometr: 101.6, rsu: 10 },
    { name: "Никольский а/д мост", kilometr: 79.6, rsu: "-" },
  ],
  neman: [
    { name: "Лунно а/д мост", kilometr: 569.6, rsu: "-" },
    { name: "Гродно обход а/д мост", kilometr: 530, rsu: 10.6 },
    { name: "Гродно кольцев.а/д мост", kilometr: 521.6, rsu: "-" },
    { name: "Румблевский а/д мост", kilometr: 519.5, rsu: "-" },
    { name: "Гродно теплотрасса мост", kilometr: 518.8, rsu: 12 },
    { name: "Гродно ж/д мост", kilometr: 517.6, rsu: "-" },
    { name: "Гродно (ул.Горновых) а/д мост", kilometr: 517, rsu: 9.3 },
    { name: "Гродно (ул.Поповича) а/д мост", kilometr: 515.3, rsu: "-" },
  ],
  avgCanal: [
    { name: "Немново а/д мост", kilometr: 4.2, rsu: 5 },
    { name: "Соничи а/д мост", kilometr: 8.5, rsu: 4.9 },
    { name: "Пограничный а/д мост", kilometr: 17.7, rsu: 4.7 },
  ],
  muhavets: [
    { name: 'Брест "Варшавский" а/д мост', kilometr: 190.2, rsu: 8 },
    { name: 'Брест "Ковельский" ж/д мост', kilometr: 189, rsu: 9 },
    { name: 'Брест "Дворец молодежи" а/д мост', kilometr: 188.1, rsu: 10 },
    { name: 'Брест "Гузни" а/д мост', kilometr: 185.3, rsu: 10.5 },
    { name: "Красный двор ж/д мост", kilometr: 184.2, rsu: 10 },
    { name: "Бульковский а/д мост", kilometr: 169.4, rsu: 10 },
    { name: "Жабинковский а/д мост", kilometr: 159.5, rsu: 10.5 },
    { name: 'Кобрин "Пролетарский" а/д мост', kilometr: 136.2, rsu: 14 },
    { name: 'Кобрин "Московский" а/д мост', kilometr: 134.2, rsu: 9.5 },
  ],
  dbk: [
    { name: 'Кобрин "Пинский" а/д мост', kilometr: 131.4, rsu: 10.5 },
    { name: 'Кобрин "Олимпийский" а/д мост', kilometr: 129.8, rsu: 10.5 },
    { name: "Ляховичский а/д мост", kilometr: 77.7, rsu: 9.3 },
    { name: "Кужеличинский а/д мост", kilometr: 42.9, rsu: 10.5 },
  ],
  pripyat: [
    { name: "Волянский ж/д мост", kilometr: 55.8, rsu: 10 },
    { name: "Черничский а/д мост", kilometr: 348.5, rsu: 10.2 },
    { name: "Мозырский ж/д мост", kilometr: 191.2, rsu: 10.2 },
    { name: "Мозырский а/д мост", kilometr: 186.7, rsu: 10.2 },
    { name: "Новиковский а/д мост", kilometr: 181.3, rsu: 10.2 },
  ],
  pina: [{ name: "Пинский а/д мост", kilometr: 0.9, rsu: "9,0-9,4" }],
  vpripyat: [{ name: "Любанский мост а/д", kilometr: 6.4, rsu: "-" }],
  zapDvina: [
    { name: "Руба а/д мост", kilometr: 638.5, rsu: 7.5 },
    { name: "Витебск а/д мост им. Кирова", kilometr: 615.3, rsu: 10 },
    { name: "Витебск а/д мост им. Блохина", kilometr: 614.1, rsu: 14 },
    { name: "Витебск Смоленский ж/д мост", kilometr: 612.8, rsu: 19.4 },
    { name: "А/д мост им. 1000 летия", kilometr: 611.3, rsu: 11.8 },
    { name: "Витебск Жлобинский ж/д мост", kilometr: 610.9, rsu: 17.5 },
    { name: "Дубрава а/д мост", kilometr: 603.9, rsu: 10 },
    { name: "Улла а/д мост", kilometr: 516.7, rsu: 18.3 },
  ],
};

export const siteRivers = [
  "Днепр",
  "Березина",
  "Сож",
  "Неман",
  "Мухавец",
  "Днепро-Бугский канал",
  "Пина",
  "Верхний участок реки Припять",
  "Припять",
  "Микашевичский канал",
  "Горынь",
  "Западная Двина",
  "Туровский затон",
  "Августовский канал",
  "Свислочь",
];

export const sibDistricts = [
  `1. р. Днепр(дер.Левки(воздушный переход) - н.п.
    Любеч(граница Белводпуть - Укрводпуть)`,
  `2. р. Березина(г.Березино(Березино - пристань) -
    устье реки Березина`,
  `3. р. Сож(г.Славгород(Славгород - город) - устье
    реки Сож)`,
  `4. р. Неман(деревня Яблоново(вход в затон) -
    граница с Литовской Республикой)`,
  `5. р. Мухавец(г.Брест(речной порт Брест) -
    г.Кобрин(слияние реки Мухавец и Днепро-Бугского канала)`,
  `6. Днепро - Бугский канал(г.Кобрин(слияние реки
    Мухавец и Днепро-Бугский канал) - слияние Днепро-Бугский канал и реки Пина)`,
  `7. р. Пина(слияние Днепро-Бугский канал и реки Пина - г.Пинск(слияние
    реки Пина и реки Припять) - знак "запрещение прохода")`,
  `8. верхний участок реки Припять(7 км реки Припять -
    г.Пинск, слияние реки Припять и реки Пина)`,
  `9. р. Припять(г.Пинск(слияние реки Пина и реки
    Припять) - пер.т Усовский-1(граница с
    Украиной))`,
  `10. Микашевичский канал(устье Микашевичского канала -
    речной порт Микашевичи)`,
  `11. р. Горынь(пер.т Комора-2 - устье реки Горынь)`,
  `12. р. Западная Двина(деревня Сураж - Полоцкая
    гидроэлектростанция)`,
  `13. Туровский затон(г.Туров(вход в затон) -
    г.Туров(причал)`,
  `14. Августовский канал(Граница с Республикой Польша - устье
    Августовского канала(слияние с рекой Неман))`,
  `15. р. Свислочь(Минская кольцевая автомобильная дорога -
    переулок Канатный)`,
];
export const sibOrganizations = [
  'РУЭСП "Днепро-Бугский водный путь"',
  'РУ Днепро-Двинское предприятие водных путей "Белводпуть"',
  "РУ Днепро-Березинское предприятие водных путей",
  'Филиал "Нижне-Припятский" г. Мозырь',
  'Филиал "Гродненский участок" г. Гродно',
  'Филиал "Витебскводтранс" г. Витебск',
];

export const spravkaOrganisations = [
  'РУЭСП "Днепро-Бугский водный путь"',
  'РУ Днепро-Двинское предприятие водных путей "Белводпуть"',
  "РУ Днепро-Березинское предприятие водных путей",
  "Белорусское речное пароходство",
];
