export const hydropostRivers = [
    "Днепр",
    "Березина",
    "Сож",
    "Припять",
    "Горынь",
    "Западная Двина",
    "Неман"
]

export const hydropostGroups = {
    dnepr: [
        "Могилев",
        "Жлобин",
        "Речица",
        "Лоев",
    ],
    berezina: [
        "Березино",
        "Бобруйск",
        "Светлогорск",
    ],
    soj: [
        "Славгород",
        "Гомель"
    ],
    pripiat: [
        "Пинск",
        "Коробье",
        "Черничи",
        "Петриков",
        "Мозырь",
        "Наровля"
    ],
    gorin: [
      "ст. Горынь",
    ],
    dvina: [
        "Сураж",
        "Витебск",
        "Полоцк"
    ],
    neman: [
        "Гродно"
    ]
}

export const hydronodeRivers = [
    "Припять",
    "Пина",
    "Днепро-Бугский канал",
    "Мухавец",
    "Западная Двина",
    "Неман",
    "Августовский канал"
]

export const hydronodeGroups = {
    pripiat: [
        "Судоходный г/у №12 Стахово",
        "Судоходный г/у №11 Качановичи"
    ],
    pina: [
        "Судоходный г/у №1 Дубой"
    ],
    dbk: [
        "Судоходный г/у №2 Переруб",
        "Судоходный г/у №3 Рагодощ",
        "Судоходный г/у №4 Овзичи",
        "Судоходный г/у №5 Ляховичи",
        "Судоходный г/у Кобрин"
    ],
    muhavets: [
        "Судоходный г/у №8 Залузье",
        "Судоходный г/у №9 Новосады",
        "Судоходный г/у №10 Тришин",
        "Брест плотина"
    ],
    zapDvina: [
        "Судоходный шлюз Витебская ГЭС"
    ],
    neman: [
        "Гродненская ГЭС"
    ],
    avgCanal: [
        "Белорусская часть г/у Кужинец",
        "Судоходный г/у Волкушек",
        "Судоходный г/у Домбровка",
        "Судоходный г/у Немново"
    ],

}

export const bridgeRivers = [
    "Днепр",
    "Березина",
    "Сож",
    "Неман",
    "Августовский канал",
    "Днепро-Бугский канал",
    "Припять",
    "Западная Двина"
]

export const bridgeGroups = {
    dnepr: [
        "Могилев а/д мост",
        "Быхов а/д мост",
        "Рогачев а/д мост",
        "Жлобин а/д мост",
        "Жлобин ж/д мост",
        "Жлобин новый ж/д мост",
        "Речицкий ж/д мост",
        "Отверницкий (старый) а/д мост", 
        "Отверницкий (новый) а/д мост"
    ],
    berezina: [
        "Березино а/д мост", 
        "Щатково а/д мост", 
        "Бобруйск а/д мост",
        "Бобруйск ж/д мост",
        "Какель ж/д мост"
    ],
    soj: [
        "Славгородский а/д мост",
        "Чечерский а/д мост", 
        "Ветковский а/д мост",
        "Кленковский ж/д мост",
        "Гомельский пешеходный мост",
        "Гомельский а/д мост",
        "Гомельский а/д мост (старый)",
        "Гомельский ж/д мост",
        "Новобелицкий а/д мост",
        "Никольский а/д мост"
    ],
    neman: [
        "Лунно а/д мост", 
        "Румблевский а/д мост",
        "Гродно обход а/д мост",
        "Гродно кольцев.а/д мост",
        "Гродно ж/д мост",
        "Гродно (ул.Горновых) а/д мост",
        "Гродно (ул.Поповича) а/д мост"
    ],
    avgCanal: [
        "Немново мост", 
        "Соничи мост",
        "Пограничный мост"
    ],
    dbk: [
        "Кужеличинский а/д мост", 
        "Ляховичский а/д мост",
        'Кобрин "Пинский" а/д мост',
        'Кобрин "Олимпийский" а/д мост', 
        'Кобрин "Московский" а/д мост',
        'Кобрин "Пролетарский" а/д мост',
        "Жабинковский а/д мост", 
        "Бульковский а/д мост",
        "Красный двор ж/д мост",
        'Брест "Гузни" а/д мост',
        'Брест "Дв-ц молодежи" а/д мост',
        'Брест "Ковельский" ж/д мост',
        'Брест "Варшавский" а/д мост'
    ],
    pripyat: [
        "Пинский а/д мост",
        "Волянский ж/д мост",
        "Черничский а/д мост",
        "Мозырский ж/д мост",
        "Мозырский а/д мост",
        "Новиковский а/д мост"
    ],
    zapDvina: [
      "Руба а/д мост",
      "Витебск а/д мост им. Кирова",
      "Витебск а/д мост им. Блохина",
      "Витебск Смоленский ж/д мост",
      "А/д мост им. 1000 летия",
      "Витебск Жлобинский ж/д мост",
      "Улла а/д мост"
  ],
}

export const siteRivers = [
    "Днепр",
    "Березина",
    "Сож",
    "Неман",
    "Мухавец",
    "Днепро-Бугский канал",
    "Пина",
    "Верхний участок реки Припять",
    "Припять",
    "Микашевичский канал",
    "Горынь",
    "Западная Двина",
    "Туровский затон",
    "Августовский канал",
    "Свислочь"
]

export const sibDistricts = [
    `1. река Днепр(дер.Левки(воздушный переход) - н.п.
    Любеч(граница Белводпуть - Укрводпуть)`,
    `2. река Березина(г.Березино(Березино - пристань) -
    устье реки Березина`,
    `3. река Сож(г.Славгород(Славгород - город) - устье
    реки Сож)`,
    `4. река Неман(деревня Яблоново(вход в затон) -
    граница с Литовской Республикой)`,
    `5. река Мухавец(г.Брест(речной порт Брест) -
    г.Кобрин(слияние реки Мухавец и Днепро-Бугского канала)`,
    `6. Днепро - Бугский канал(г.Кобрин(слияние реки
    Мухавец и Днепро-Бугский канал) - слияние Днепро-Бугский канал и реки Пина)`,
    `7. река Пина(слияние Днепро-Бугский канал и реки Пина - г.Пинск(слияние
    реки Пина и реки Припять) - знак "запрещение прохода")`,
    `8. верхний участок реки Припять(7 км реки Припять -
    г.Пинск, слияние реки Припять и реки Пина)`,
    `9. река Припять(г.Пинск(слияние реки Пина и реки
    Припять) - перекат Усовский-1(граница с
    Украиной))`,
    `10. Микашевичский канал(устье Микашевичского канала -
    речной порт Микашевичи)`,
    `11. река Горынь(перекат Комора-2 - устье реки Горынь)`,
    `12. река Западная Двина(деревня Сураж - Полоцкая
    гидроэлектростанция)`,
    `13. Туровский затон(г.Туров(вход в затон) -
    г.Туров(причал)`,
    `14. Августовский канал(Граница с Республикой Польша - устье
    Августовского канала(слияние с рекой Неман))`,
    `15. река Свислочь(Минская кольцевая автомобильная дорога -
    переулок Канатный)`
]
export const sibOrganizations = [
    "РУ ЭСП \"Днепро-Бугский водный путь\"",
    "РУ Днепро-Двинское предприятие водных путей \"Белводпуть\"",
    "РУ Днепро-Березинское предприятие водных путей",
    "Нижне - Припятский",
    "Гродненский участок",
    "Витебскводтранс"    
]