export const hydropostRivers = [
    "Днепр",
    "Березина",
    "Сож",
    "Припять",
    "Горынь",
    "Зап. Двина",
    "Неман"
]

export const hydropostGroups = {
    dnepr: [
        "Могилев",
        "Лоев",
        "Жлобин",
        "Речица"
    ],
    berezina: [
        "Березено",
        "Бобруйск",
        "Светлогорск",
    ],
    soj: [
        "Славгород",
        "Гомель"
    ],
    pripiat: [
        "Пинск",
        "Коробье",
        "Черничи",
        "Мозырь"
    ],
    gorin: [
      "ст.Горынь",
    ],
    dvina: [
        "Сураж",
        "Витебск",
        "Полоцк"
    ],
    neman: [
        "Гродно"
    ]
}

export const hydronodeRivers = [
    "Припять",
    "Пина",
    "ДБК",
    "Мухавец",
    "Западная Двина",
    "Неман",
    "Августовский канал"
]

export const hydronodeGroups = {
    pripiat: [
        "Судоходный г/у №12 Стахово",
        "Судоходный г/у №11 Качановичи"
    ],
    pina: [
        "Судоходный г/у №1 Дубой"
    ],
    dbk: [
        "Судоходный г/у №2 Переруб",
        "Судоходный г/у №3 Рагодощ",
        "Судоходный г/у №4 Овзичи",
        "Судоходный г/у №5 Ляховичи",
        "Судоходный г/у Кобрин"
    ],
    muhavets: [
        "Судоходный г/у №8 Залузье",
        "Судоходный г/у №9 Новосады",
        "Судоходный г/у №10 Тришин",
        "Брест плотина"
    ],
    zapDvina: [
        "Судоходный шлюз Витебская ГЭС"
    ],
    neman: [
        "Гродненская ГЭС"
    ],
    avgCanal: [
        "Белорусская часть г/у Кужинец",
        "Судоходный г/у Волкушек",
        "Судоходный г/у Домбровка",
        "Судоходный г/у Немново	"
    ],

}

export const bridgeRivers = [
    "Днепр",
    "Березина",
    "Сож",
    "Неман",
    "Августовский канал",
    "ДБК",
    "Припять",
    "Западная Двина"
]

export const bridgeGroups = {
    dnepr: [
        "Отверницкий (новый) а/д мост", 
        "Отверницкий (старый) а/д мост", 
        "Речицкий ж/д мост",
        "Жлобин новый ж/д мост",
        "Жлобин ж/д мост",
        "Жлобин а/д мост",
        "Рогачев а/д мост",
        "Быхов а/д мост",
        "Могилев а/д мост"
    ],
    berezina: [
        "Березино а/д мост", 
        "Щатково а/д мост", 
        "Бобруйск а/д мост",
        "Бобруйск ж/д мост",
        "Какель ж/д мост"
    ],
    soj: [
        "Чечерский а/д мост", 
        "Ветковский а/д мост",
        "Кленковский ж/д мост",
        "Гомельский пешеходный мост",
        "Гомельский а/д  мост",
        "Гомельский а/д  мост (старый)",
        "Гомельский ж/д мост",
        "Новобелицкий а/д мост",
        "Никольский а/д мост"
    ],
    neman: [
        "Лунно а/д мост", 
        "Румблевский а/д мост",
        "Гродно обход а/д мост",
        "Гродно кольцев.а/д мост",
        "Гродно ж/д мост",
        "Гродно (ул.Горновых) а/д мост",
        "Гродно (ул.Поповича) а/д мост"
    ],
    avgCanal: [
        "Немново мост", 
        "Соничи мост",
        "Пограничный мост"
    ],
    dbk: [
        "Кужеличинский а/д мост", 
        "Ляховичский а/д мост",
        "Кобрин \"Пинский\" а/д мост",
        "Кобрин \"Олимпийский\" а/д мост", 
        "Кобрин \"Московский\" а/д мост",
        "Кобрин \"Пролетарский\" а/д мост",
        "Жабинковский а/д мост", 
        "Бульковский а/д мост",
        "Красный двор ж/д мост",
        "Брест \"Гузни\" а/д мост",
        "Брест \"Дв-ц молодежи\" а/д мост",
        "Брест \"Ковельский\" ж/д мост",
        "Брест \"Варшавский\" а/д мост"
    ],
    pripyat: [
        "Пинский а/д мост",
        "Волянский ж/д мост",
        "Черничский а/д мост",
        "Мозырский ж/д мост",
        "Мозырский а/д мост",
        "Новиковский а/д мост"
    ],
    zapDvina: [
      "Руба а/д мост",
      "Витебск а/д мост им. Кирова",
      "Витебск а/д мост им. Блохина",
      "Витебск Смоленский ж/д мост",
      "А/д мост им. 1000 летия",
      "Витебск Жлобинский ж/д мост",
      "Улла а/д мост"
  ],
}

export const siteRivers = [
    "Днепр",
    "Березина",
    "Сож",
    "Неман",
    "Мухавец",
    "Днепро-Бугский канал",
    "Пина",
    "Верхний участок реки Припять",
    "Припять",
    "Микашевичский канал",
    "Горынь",
    "Западная Двина",
    "Туровский затон",
    "Августовский канал",
    "Свислочь"
]

export const siteGroups = {
    dnepr: [
        "1.1 дер.Левки (воздушный переход) – Прудки III",
        "1.2 Прудки III – Могилев (мостовой переход)",
        "1.3 Могилев (мостовой переход) – прк. Стайки III",
        "1.4 прк. Стайки III – Быхов",
        "1.5 Быхов – у.р. Друть",
        "1.6 у.р. Друть – у.р. Березины",
        "1.7 у.р. Березины – прк. Черное I",
        "1.8 прк. Черное I – Речицкий ССРЗ",
        "1.9 Речицкий ССРЗ – прк. Боровая I",
        "1.10 прк. Боровая I – Подречицкое",
        "1.11.1 Подречицкое – 1082 км",
        "1.11.2 1082 км – Каменка ",
        "1.12 Каменка – н.п. Любеч (гр. Белводпуть - Укрводпуть)"
    ],
    berezina: [
        "2.1 г.Березино (Березино пристань) – у.р. Волчанки",
        "2.2.1 у.р. Волчанки – прк. Течка",
        "2.2.2 прк. Течка – Бобруйский порт",
        "2.3 Бобруйский порт – прк. Волышино",
        "2.4 прк. Волышино – оз. Сельное",
        "2.5 оз. Сельное – Якимова Слобода IV",
        "2.6 Якимова Слобода IV – устье реки Березина"
    ],
    soj: [
        "3.1 г. Славгород (Славгород - город) – Чечерский а/м мост",
        "3.2.1 Чечерский автомобильный мост - пкр. у.р.Беседь 2",
        "3.2.2 прк. у.р.Беседь 2 - прк. Крысин 1",
        "3.3.1 прк. Крысин 1 – старица \"Боровая\" исток",
        "3.3.2 старица \"Боровая\" исток –  Гомель пристань",
        "3.4 Гомель пристань – порт Осовцы",
        "3.5 порт Осовцы – прк. Никольский 3",
        "3.6.1 прк. Никольский 3 – 35 км",
        "3.6.2 35 км – прк. Карповка 1",
        "3.7 прк. Карповка 1 – устье реки Сож",
    ],
    neman: [
        "4.1 деревня Яблоново (вход в затон) – д. Ковшово",
        "4.2 деревня Ковшово – Гродненская ГЭС",
        "4.3.1 Гродненская ГЭС - прк. Городнянка",
        "4.3.2 прк. Городнянка - граница с Литовской Республикой",
    ],
    muhavets: [
        "5.1 г. Брест (речной порт Брест) – г/у \"Тришин\"",
        "5.2 г/у \"Тришин\" – г/у \"Новосады\" ",
        "5.3 г/у Новосады – г.Кобрин (слияние р. Мухавец и ДБК)",
    ],
    dnepBug: [
        "6.1.1 г. Кобрин (слияние р. Мухавец и ДБК) – г/у 4 Овзичи",
        "6.1.2 г/у 4 Овзичи - слияние ДБК и р.Пина",
    ],
    pina: [
        "7.1 слияние ДБК и реки Пина-г/у \"Дубой\"",
        "7.2 г/у \"Дубой\" – порт Пинск",
        "7.3 порт Пинск – г.Пинск (сл. рек Пина и Припять)",
        "7.4 Слияние р.Пина и Припять – знак \"Запрещение прохода\"",
    ],
    upperPripyat: [
        "8.1 7 км реки Припять – г.Пинск (слияние рек Пина и Припять)",
    ],
    pripyat: [
        "9.1 г.Пинск (сл. рр Пина и Припять) – г/у \"Качановичи\"",
        "9.2 г/у \"Качановичи\" – г/у \"Стахово\"",
        "9.3 г/у \"Стахово\" – устье р. Горынь",
        "9.4 устье р. Горынь – устье Микашевичского канала",
        "9.5 устье Микашевичского канала – дер. Балажевичи",
        "9.6.1 дер. Балажевичи – прк. Лучежевичский 1",
        "9.6.2 прк. Лучежевичский 1 – Пховский затон",
        "9.7.1 Пховский затон – затон Кимборовка",
        "9.7.2.1 затон Кимборовка – д. Конотоп",
        "9.7.2.2.1 д.Конотоп-прк.Довлядовское спрямление",
        "9.7.2.2.2 прк.Довлядовское спрямление – прк. Усовский-1 (граница с Украиной)",
    ],
    mikashevichskiCanal: [
        "10.1 устье Микашевичского канала – р.п. Микашевичи",
    ],
    gorin: [
        "11.1 перекат Комора-2 – устье реки Горынь",
    ],
    zapDvina: [
        "12.1 деревня Сураж – д. Круподеры",
        "12.2 д. Круподеры – Витебская ГЭС",
        "12.3 Витебская ГЭС – Витебск (груз.) порт",
        "12.4 Витебск (груз.) порт – д. Слобода",
        "12.5 д. Слобода – г. Бешенковичи",
        "12.6 г. Бешенковичи – прк. Сосница",
        "12.7 прк. Сосница – Полоцкая гидроэлектростанция",
    ],
    turovskiZaton: [
        "13.1 г. Туров (вход в затон) – г. Туров (причал)",
    ],
    avgustovskiCanal: [
        "14.1 Граница с Республикой Польша –16 км Августовского канала",
        "14.2 16 км Августовского канала – устье Августовского канала (слияние с рекой Неман)",
    ],
    svisloch: [
        "15.1 МКАД – МГЭС (Водохранилище \"Дрозды\")",
        "15.2 МГЭС (в-ще \"Дрозды\") – ул.Орловская (ниж. гр. пляжа)",
        "15.3 ул.Орловская (ниж. гр. пляжа) – пер. Канатный",
    ],
  }