export const hydropostRivers = [
    "Припять",
    "Зап. Двина",
]

export const hydropostGroups = {
    pripiat: [
        "Пинск",
        "Коробье",
        "Черничи",
        "Мозырь"
    ],
    dvina: [
        "Сураж",
        "Витебск",
        "Полоцк"
    ]
}

export const hydronodeRivers = [
    "Припять",
    "ДБК",
    "Мухавец",
    "Западная Двина",
]

export const hydronodeGroups = {
    pripiat: [
        "Судоходный г/у №12 Стахово",
        "Судоходный г/у №11 Качановичи"
    ],
    dbk: [
        "Судоходный г/у №2 Переруб",
        "Судоходный г/у №3 Рагодощ",
        "Судоходный г/у №4 Овзичи",
        "Судоходный г/у №5 Ляховичи",
        "Судоходный г/у Кобрин"
    ],
    muhavets: [
        "Судоходный г/у №8 Залузье",
        "Судоходный г/у №9 Новосады",
        "Судоходный г/у №10 Тришин",
        "Брест плотина"
    ],
    zapDvina: [
        "Судоходный шлюз Витебская ГЭС"
    ]

}

export const bridgeRivers = [
    "ДБК",
    "Припять",
    "Западная Двина"
]

export const bridgeGroups = {
    dbk: [
        "Кужеличинский а/д мост", 
        "Ляховичский а/д мост",
        "Кобрин \"Пинский\" а/д мост",
        "Кобрин \"Олимпийский\" а/д мост", 
        "Кобрин \"Московский\" а/д мост",
        "Кобрин \"Пролетарский\" а/д мост",
        "Жабинковский а/д мост", 
        "Бульковский а/д мост",
        "Красный двор ж/д мост",
        "Брест \"Гузни\" а/д мост",
        "Брест \"Дв-ц молодежи\" а/д мост",
        "Брест \"Ковельский\" ж/д мост",
        "Брест \"Варшавский\" а/д мост"
    ],
    pripyat: [
        "Пинский а/д мост",
        "Волянский ж/д мост",
        "Черничский а/д мост",
        "Мозырский ж/д мост",
        "Мозырский а/д мост",
        "Новиковский а/д мост"
    ],
    zapDvina: [
      "Руба а/д мост",
      "Витебск а/д мост им. Кирова",
      "Витебск а/д мост им. Блохина",
      "Витебск Смоленский ж/д мост",
      "А/д мост им. 1000 летия",
      "Витебск Жлобинский ж/д мост",
      "Улла а/д мост"
  ],
}

export const siteRivers = [
    "Мухавец",
    "Днепро-Бугский канал",
    "Пина",
    "Верхний участок реки Припять",
    "Припять",
    "Микашевичский канал",
    "Западная Двина",
    "Свислочь"
]

export const siteGroups = {
    muhavets: [
        "5.1 г. Брест (речной порт Брест) – г/у \"Тришин\"",
        "5.2 г/у \"Тришин\" – г/у \"Новосады\" ",
        "5.3 г/у Новосады – г.Кобрин (слияние р. Мухавец и ДБК)",
    ],
    dnepBug: [
        "6.1.1 г. Кобрин (слияние р. Мухавец и ДБК) – г/у 4 Овзичи",
        "6.1.2 г/у 4 Овзичи - слияние ДБК и р.Пина",
    ],
    pina: [
        "7.1 слияние ДБК и реки Пина-г/у \"Дубой\"",
        "7.2 г/у \"Дубой\" – порт Пинск",
        "7.3 порт Пинск – г.Пинск (сл. рек Пина и Припять)",
        "7.4 Слияние р.Пина и Припять – знак \"Запрещение прохода\"",
    ],
    upperPripyat: [
        "8.1 7 км реки Припять – г.Пинск (слияние рек Пина и Припять)",
    ],
    pripyat: [
        "9.1 г.Пинск (сл. рр Пина и Припять) – г/у \"Качановичи\"",
        "9.2 г/у \"Качановичи\" – г/у \"Стахово\"",
        "9.3 г/у \"Стахово\" – устье р. Горынь",
        "9.4 устье р. Горынь – устье Микашевичского канала",
        "9.5 устье Микашевичского канала – дер. Балажевичи",
        "9.6.1 дер. Балажевичи – прк. Лучежевичский 1",
        "9.6.2 прк. Лучежевичский 1 – Пховский затон",
        "9.7.1 Пховский затон – затон Кимборовка",
        "9.7.2.1 затон Кимборовка – д. Конотоп",
        "9.7.2.2.1 д.Конотоп-прк.Довлядовское спрямление",
        "9.7.2.2.2 прк.Довлядовское спрямление – прк. Усовский-1 (граница с Украиной)",
    ],
    mikashevichskiCanal: [
        "10.1 устье Микашевичского канала – р.п. Микашевичи",
    ],
    zapDvina: [
        "12.1 деревня Сураж – д. Круподеры",
        "12.2 д. Круподеры – Витебская ГЭС",
        "12.3 Витебская ГЭС – Витебск (груз.) порт",
        "12.4 Витебск (груз.) порт – д. Слобода",
        "12.5 д. Слобода – г. Бешенковичи",
        "12.6 г. Бешенковичи – прк. Сосница",
        "12.7 прк. Сосница – Полоцкая гидроэлектростанция",
    ],
    svisloch: [
        "15.1 МКАД – МГЭС (Водохранилище \"Дрозды\")",
        "15.2 МГЭС (в-ще \"Дрозды\") – ул.Орловская (ниж. гр. пляжа)",
        "15.3 ул.Орловская (ниж. гр. пляжа) – пер. Канатный",
    ],
  }