export const hydropostRivers = ["Припять", "Западная Двина", "Горынь"];

export const hydropostGroups = {
  pripiat: ["Пинск", "Коробье", "Черничи", "Петриков", "Мозырь", "Наровля"],
  dvina: ["Сураж", "Витебск", "Полоцк"],
  gorin: ["ст.Горынь"],
};

export const hydronodeRivers = [
  "Припять",
  "Пина",
  "Днепро-Бугский канал",
  "Мухавец",
  "Западная Двина",
];

export const hydronodeGroups = {
  pripiat: ["Судоходный г/у №12 Стахово", "Судоходный г/у №11 Качановичи"],
  pina: ["Судоходный г/у №1 Дубой"],
  dbk: [
    "Судоходный г/у №2 Переруб",
    "Судоходный г/у №3 Рагодощ",
    "Судоходный г/у №4 Овзичи",
    "Судоходный г/у №5 Ляховичи",
    "Судоходный г/у Кобрин",
  ],
  muhavets: [
    "Судоходный г/у №8 Залузье",
    "Судоходный г/у №9 Новосады",
    "Судоходный г/у №10 Тришин",
    "Брест плотина",
  ],
  zapDvina: ["Судоходный шлюз Витебская ГЭС"],
};

export const bridgeRivers = [
  "Днепро-Бугский канал",
  "Припять",
  "Западная Двина",
];  

export const bridgeGroups = {
  dbk: [
    "Кужеличинский а/д мост",
    "Ляховичский а/д мост",
    'Кобрин "Пинский" а/д мост',
    'Кобрин "Олимпийский" а/д мост',
    'Кобрин "Московский" а/д мост',
    'Кобрин "Пролетарский" а/д мост',
    "Жабинковский а/д мост",
    "Бульковский а/д мост",
    "Красный двор ж/д мост",
    'Брест "Гузни" а/д мост',
    'Брест "Дв-ц молодежи" а/д мост',
    'Брест "Ковельский" ж/д мост',
    'Брест "Варшавский" а/д мост',
  ],
  pripyat: [
    "Пинский а/д мост",
    "Волянский ж/д мост",
    "Черничский а/д мост",
    "Мозырский ж/д мост",
    "Мозырский а/д мост",
    "Новиковский а/д мост",
  ],
  zapDvina: [
    "Руба а/д мост",
    "Витебск а/д мост им. Кирова",
    "Витебск а/д мост им. Блохина",
    "Витебск Смоленский ж/д мост",
    "А/д мост им. 1000 летия",
    "Витебск Жлобинский ж/д мост",
    "Улла а/д мост",
  ],
};

export const siteRivers = [
  "Мухавец",
  "Днепро-Бугский канал",
  "Пина",
  "Верхний участок реки Припять",
  "Припять",
  "Микашевичский канал",
  "Горынь",
  "Западная Двина",
  "Туровский затон",
  "Августовский канал",
  "Свислочь",
];

export const sibDistricts = [
  `5. река Мухавец(г.Брест(речной порт Брест) -
  г.Кобрин(слияние реки Мухавец и Днепро-Бугского канала)`,
  `6. Днепро - Бугский канал(г.Кобрин(слияние реки
  Мухавец и Днепро-Бугский канал) - слияние Днепро-Бугский канал и реки Пина)`,
  `7. река Пина(слияние Днепро-Бугский канал и реки Пина - г.Пинск(слияние
  реки Пина и реки Припять) - знак "запрещение прохода")`,
  `8. верхний участок реки Припять(7 км реки Припять -
  г.Пинск, слияние реки Припять и реки Пина)`,
  `9. река Припять(г.Пинск(слияние реки Пина и реки
  Припять) - перекат Усовский-1(граница с
  Украиной))`,
  `10. Микашевичский канал(устье Микашевичского канала -
  речной порт Микашевичи)`,
  `11. река Горынь(перекат Комора-2 - устье реки Горынь)`,
  `12. река Западная Двина(деревня Сураж - Полоцкая
  гидроэлектростанция)`,
  `13. Туровский затон(г.Туров(вход в затон) -
  г.Туров(причал)`,
  `14. Августовский канал(Граница с Республикой Польша - устье
  Августовского канала(слияние с рекой Неман))`,
  `15. река Свислочь(Минская кольцевая автомобильная дорога -
  переулок Канатный)`
]
export const sibOrganizations = [
  "РУ ЭСП \"Днепро-Бугский водный путь\"", 
]