export const hydropostRivers = ["Припять", "Западная Двина", "Горынь"];

export const hydropostGroups = {
  pripiat: ["Пинск", "Коробье", "Черничи", "Петриков", "Мозырь", "Наровля"],
  dvina: ["Сураж", "Витебск", "Полоцк"],
  gorin: ["ст. Горынь"],
};

export const hydronodeRivers = [
  "Припять",
  "Пина",
  "Днепро-Бугский канал",
  "Мухавец",
  "Западная Двина",
];

export const hydronodeGroups = {
  pripiat: ["Судоходный г/у №11 Качановичи", "Судоходный г/у №12 Стахово"],
  pina: ["Судоходный г/у №1 Дубой"],
  dbk: [
    "Судоходный г/у №2 Переруб",
    "Судоходный г/у №3 Рагодощ",
    "Судоходный г/у №4 Овзичи",
    "Судоходный г/у №5 Ляховичи",
    "Судоходный г/у Кобрин",
  ],
  muhavets: [
    "Судоходный г/у №8 Залузье",
    "Судоходный г/у №9 Новосады",
    "Судоходный г/у №10 Тришин",
    "Брест плотина",
  ],
  zapDvina: ["Судоходный шлюз Витебская ГЭС", "Полоцкая ГЭС"],
};

export const bridgeRivers = [
  "Мухавец",
  "Днепро-Бугский канал",
  "Пина",
  "Верхний участок реки Припять",
  "Припять",
  "Западная Двина",
];

export const bridgeGroups = {
  dbk: [
    { name: 'Кобрин "Пинский" а/д мост', kilometr: 131.4, rsu: 10.5 },
    { name: 'Кобрин "Олимпийский" а/д мост', kilometr: 129.8, rsu: 10.5 },
    { name: "Ляховичский а/д мост", kilometr: 77.7, rsu: 9.3 },
    { name: "Кужеличинский а/д мост", kilometr: 42.9, rsu: 10.5 },
  ],
  muhavets: [
    { name: 'Брест "Варшавский" а/д мост', kilometr: 190.2, rsu: 8 },
    { name: 'Брест "Ковельский" ж/д мост', kilometr: 189, rsu: 9 },
    { name: 'Брест "Дворец молодежи" а/д мост', kilometr: 188.1, rsu: 10 },
    { name: 'Брест "Гузни" а/д мост', kilometr: 185.3, rsu: 10.5 },
    { name: "Красный двор ж/д мост", kilometr: 184.2, rsu: 10 },
    { name: "Бульковский а/д мост", kilometr: 169.4, rsu: 10 },
    { name: "Жабинковский а/д мост", kilometr: 159.5, rsu: 10.5 },
    { name: 'Кобрин "Пролетарский" а/д мост', kilometr: 136.2, rsu: 14 },
    { name: 'Кобрин "Московский" а/д мост', kilometr: 134.2, rsu: 9.5 },
  ],
  pripyat: [
    { name: "Волянский ж/д мост", kilometr: 55.8, rsu: 10 },
    { name: "Черничский а/д мост", kilometr: 348.5, rsu: 10.2 },
    { name: "Мозырский ж/д мост", kilometr: 191.2, rsu: 10.2 },
    { name: "Мозырский а/д мост", kilometr: 186.7, rsu: 10.2 },
    { name: "Новиковский а/д мост", kilometr: 181.3, rsu: 10.2 },
  ],
 
  zapDvina: [
    { name: "Руба а/д мост", kilometr: 638.5, rsu: 7.5 },
    { name: "Витебск а/д мост им. Кирова", kilometr: 615.3, rsu: 10 },
    { name: "Витебск а/д мост им. Блохина", kilometr: 614.1, rsu: 14 },
    { name: "Витебск Смоленский ж/д мост", kilometr: 612.8, rsu: 19.4 },
    { name: "А/д мост им. 1000 летия", kilometr: 611.3, rsu: 11.8 },
    { name: "Витебск Жлобинский ж/д мост", kilometr: 610.9, rsu: 17.5 },
    { name: "Дубрава а/д мост", kilometr: 603.9, rsu: 10 },
    { name: "Улла а/д мост", kilometr: 516.7, rsu: 18.3 },
  ],
  pina: [
    { name: "Пинский а/д мост", kilometr: 0.9, rsu: "9,0-9,4" },
  ],
  vpripyat: [
    { name: "Любанский мост а/д", kilometr: 6.4, rsu: "-" },
  ],
};

export const siteRivers = [
  "Мухавец",
  "Днепро-Бугский канал",
  "Пина",
  "Верхний участок реки Припять",
  "Припять",
  "Микашевичский канал",
  "Горынь",
  "Западная Двина",
  "Туровский затон",
];

export const sibDistricts = [
  `5. р. Мухавец(г.Брест(речной порт Брест) -
  г.Кобрин(слияние реки Мухавец и Днепро-Бугского канала)`,
  `6. Днепро - Бугский канал(г.Кобрин(слияние реки
  Мухавец и Днепро-Бугский канал) - слияние Днепро-Бугский канал и реки Пина)`,
  `7. р. Пина(слияние Днепро-Бугский канал и реки Пина - г.Пинск(слияние
  реки Пина и реки Припять) - знак "запрещение прохода")`,
  `8. верхний участок реки Припять(7 км реки Припять -
  г.Пинск, слияние реки Припять и реки Пина)`,
  `9. р. Припять(г.Пинск(слияние реки Пина и реки
  Припять) - пер.т Усовский-1(граница с
  Украиной))`,
  `10. Микашевичский канал(устье Микашевичского канала -
  речной порт Микашевичи)`,
  `11. р. Горынь(пер.т Комора-2 - устье реки Горынь)`,
  `12. р. Западная Двина(деревня Сураж - Полоцкая
  гидроэлектростанция)`,
  `13. Туровский затон(г.Туров(вход в затон) -
  г.Туров(причал)`,
];

export const sibOrganizations = [
  'РУЭСП "Днепро-Бугский водный путь"',
  'Филиал "Витебскводтранс" г. Витебск',
  'Филиал "Нижне-Припятский" г. Мозырь',
];

export const spravkaOrganisations = ['РУЭСП "Днепро-Бугский водный путь"'];
