export const hydropostRivers = [
    "Днепр",
    "Сож",
    "Неман"
]

export const hydropostGroups = {
    dnepr: [
        "Речица",
        "Лоев",
    ],
    soj: [
        "Славгород",
        "Гомель"
    ],
    neman: [
        "Гродно"
    ]
}

export const hydronodeRivers = [
    "Августовский канал",
    "Неман",
]

export const hydronodeGroups = {
    avgCanal: [
        "Белорусская часть г/у Кужинец",
        "Судоходный г/у Волкушек",
        "Судоходный г/у Домбровка",
        "Судоходный г/у Немново	"
    ],
    neman: [
        "Гродненская ГЭС"
    ],
}

export const bridgeRivers = [
    "Днепр",
    "Сож",
    "Неман",
    "Августовский канал"
]

export const bridgeGroups = {
    dnepr: [
        "Речицкий ж/д мост",
        "Отверницкий (старый) а/д мост", 
        "Отверницкий (новый) а/д мост"
    ],
    soj: [
        "Славгородский а/д мост",
        "Чечерский а/д мост", 
        "Ветковский а/д мост",
        "Кленковский ж/д мост",
        "Гомельский пешеходный мост",
        "Гомельский а/д  мост",
        "Гомельский а/д  мост (старый)",
        "Гомельский ж/д мост",
        "Новобелицкий а/д мост",
        "Никольский а/д мост"
    ],
    neman: [
        "Лунно а/д мост", 
        "Румблевский а/д мост",
        "Гродно обход а/д мост",
        "Гродно кольцев.а/д мост",
        "Гродно ж/д мост",
        "Гродно (ул.Горновых) а/д мост",
        "Гродно (ул.Поповича) а/д мост"
    ],
    avgCanal: [
        "Немново мост", 
        "Соничи мост",
        "Пограничный мост"
    ],
}

export const siteRivers = [
    "Днепр",
    "Сож",
    "Неман",
    "Августовский канал",
]