export const hydropostRivers = [
    "Днепр",
    "Сож",
    "Неман"
]

export const hydropostGroups = {
    dnepr: [
        "Лоев",
        "Речица"
    ],
    soj: [
        "Славгород",
        "Гомель"
    ],
    neman: [
        "Гродно"
    ]
}

export const hydronodeRivers = [
    "Августовский канал"
]

export const hydronodeGroups = {
    avgCanal: [
        "Судоходный г/у Домбровка",
        "Судоходный г/у Немново	"
    ],

}

export const bridgeRivers = [
    "Днепр",
    "Сож",
    "Неман",
    "Августовский канал"
]

export const bridgeGroups = {
    dnepr: [
        "Отверницкий (новый) а/д мост", 
        "Отверницкий (старый) а/д мост", 
        "Речицкий ж/д мост",
    ],
    soj: [
        "Чечерский а/д мост", 
        "Ветковский а/д мост",
        "Кленковский ж/д мост",
        "Гомельский пешеходный мост",
        "Гомельский а/д  мост",
        "Гомельский а/д  мост (старый)",
        "Гомельский ж/д мост",
        "Новобелицкий а/д мост",
        "Никольский а/д мост"
    ],
    neman: [
        "Лунно а/д мост", 
        "Румблевский а/д мост",
        "Гродно обход а/д мост",
        "Гродно кольцев.а/д мост",
        "Гродно ж/д мост",
        "Гродно (ул.Горновых) а/д мост",
        "Гродно (ул.Поповича) а/д мост"
    ],
    avgCanal: [
        "Немново мост", 
        "Соничи мост",
        "Пограничный мост"
    ],
}

export const siteRivers = [
    "Днепр",
    "Сож",
    "Неман",
    "Августовский канал",
]

export const siteGroups = {
    dnepr: [
        "1.7 у.р. Березины – прк. Черное I",
        "1.8 прк. Черное I – Речицкий ССРЗ",
        "1.9 Речицкий ССРЗ – прк. Боровая I",
        "1.10 прк. Боровая I – Подречицкое",
        "1.11.1 Подречицкое – 1082 км",
        "1.11.2 1082 км – Каменка ",
        "1.12 Каменка – н.п. Любеч (гр. Белводпуть - Укрводпуть)"
    ],
    soj: [
        "3.1 г. Славгород (Славгород - город) – Чечерский а/м мост",
        "3.2.1 Чечерский автомобильный мост - пкр. у.р.Беседь 2",
        "3.2.2 прк. у.р.Беседь 2 - прк. Крысин 1",
        "3.3.1 прк. Крысин 1 – старица \"Боровая\" исток",
        "3.3.2 старица \"Боровая\" исток –  Гомель пристань",
        "3.4 Гомель пристань – порт Осовцы",
        "3.5 порт Осовцы – прк. Никольский 3",
        "3.6.1 прк. Никольский 3 – 35 км",
        "3.6.2 35 км – прк. Карповка 1",
        "3.7 прк. Карповка 1 – устье реки Сож",
    ],
    neman: [
        "4.1 деревня Яблоново (вход в затон) – д. Ковшово",
        "4.2 деревня Ковшово – Гродненская ГЭС",
        "4.3.1 Гродненская ГЭС - прк. Городнянка",
        "4.3.2 прк. Городнянка - граница с Литовской Республикой",
    ],
    avgustovskiCanal: [
        "14.1 Граница с Республикой Польша –16 км Августовского канала",
        "14.2 16 км Августовского канала – устье Августовского канала (слияние с рекой Неман)",
    ],
  }