export const hydropostRivers = [
    "Днепр",
    "Сож",
    "Неман"
]

export const hydropostGroups = {
    dnepr: [
        "Речица",
        "Лоев",
    ],
    soj: [
        "Славгород",
        "Гомель"
    ],
    neman: [
        "Гродно"
    ]
}

export const hydronodeRivers = [
    "Августовский канал",
    "Неман",
]

export const hydronodeGroups = {
    avgCanal: [
        "Белорусская часть г/у Кужинец",
        "Судоходный г/у Волкушек",
        "Судоходный г/у Домбровка",
        "Судоходный г/у Немново"
    ],
    neman: [
        "Гродненская ГЭС"
    ],
}

export const bridgeRivers = [
    "Днепр",
    "Сож",
    "Неман",
    "Августовский канал"
]

export const bridgeGroups = {
    dnepr: [
        { name: "Речицкий ж/д мост", kilometr: 1169.8, rsu: 4.8 },
        { name: "Отверницкий (старый) а/д мост", kilometr: 1159.3, rsu: 9 },
        { name: "Отверницкий (новый) а/д мост", kilometr: 1159.3, rsu: "-" }
      ],
      soj: [
        { name: "Славгородский а/д мост", kilometr: 294.6, rsu: 7 },
        { name: "Чечерский а/д мост", kilometr: 205.8, rsu: 9.1 },
        { name: "Ветковский а/д мост", kilometr: 132.7, rsu: 6.95 },
        { name: "Кленковский ж/д мост", kilometr: 112.7, rsu: 5.4 },
        { name: "Гомельский пешеходный мост", kilometr: 107, rsu: 10 },
        { name: "Гомельский а/д мост", kilometr: 105.4, rsu: 5.3 },
        { name: "Гомельский а/д мост (старый)", kilometr: 105.4, rsu: 5.3 },
        { name: "Гомельский ж/д мост", kilometr: 105.1, rsu: 5.4 },
        { name: "Новобелицкий а/д мост", kilometr: 101.6, rsu: 10 },
        { name: "Никольский а/д мост", kilometr: 79.6, rsu: "-" }
      ],
      neman: [
        { name: "Лунно а/д мост", kilometr: 569.6, rsu: "-" },
        { name: "Гродно обход а/д мост", kilometr: 530, rsu: 10.6 },
        { name: "Гродно кольцев.а/д мост", kilometr: 521.6, rsu: "-" },
        { name: "Румблевский а/д мост", kilometr: 519.5, rsu: "-" },
        { name: "Гродно теплотрасса мост", kilometr: 518.8, rsu: 12 },
        { name: "Гродно ж/д мост", kilometr: 517.6, rsu: "-" },
        { name: "Гродно (ул.Горновых) а/д мост", kilometr: 517, rsu: 9.3 },
        { name: "Гродно (ул.Поповича) а/д мост", kilometr: 515.3, rsu: "-" },
      ],
      avgCanal: [
        { name: "Немново а/д мост", kilometr: 4.2, rsu: 5 },
        { name: "Соничи а/д мост", kilometr: 8.5, rsu: 4.9 },
        { name: "Пограничный а/д мост", kilometr: 17.7, rsu: 4.7 },
      ],
}

export const siteRivers = [
    "Днепр",
    "Сож",
    "Неман",
    "Августовский канал",
    "Свислочь",
]

export const sibDistricts = [
    `1. р. Днепр(дер.Левки(воздушный переход) - н.п.
    Любеч(граница Белводпуть - Укрводпуть)`,
    `3. р. Сож(г.Славгород(Славгород - город) - устье
    реки Сож)`,
    `4. р. Неман(деревня Яблоново(вход в затон) -
    граница с Литовской Республикой)`,
    `14. Августовский канал(Граница с Республикой Польша - устье
    Августовского канала(слияние с рекой Неман))`,
    `15. р. Свислочь(Минская кольцевая автомобильная дорога -
        переулок Канатный)`
]
export const sibOrganizations = [
    "РУ Днепро-Двинское предприятие водных путей \"Белводпуть\"", 
    'Филиал \"Гродненский участок\" г. Гродно',
]

export const spravkaOrganisations = [
    "РУ Днепро-Двинское предприятие водных путей \"Белводпуть\"",
]