export const hydropostRivers = [
    "Неман"
]

export const hydropostGroups = {
    neman: [
        "Гродно"
    ]
}

export const hydronodeRivers = [
    "Августовский канал",
    "Неман",
]

export const hydronodeGroups = {
    avgCanal: [
        "Белорусская часть г/у Кужинец",
        "Судоходный г/у Волкушек",
        "Судоходный г/у Домбровка",
        "Судоходный г/у Немново	"
    ],
    neman: [
        "Гродненская ГЭС"
    ],
}

export const bridgeRivers = [
    "Неман",
    "Августовский канал"
]

export const bridgeGroups = {
    avgCanal: [
        "Немново мост", 
        "Соничи мост",
        "Пограничный мост"
    ],
    neman: [
        "Лунно а/д мост", 
        "Румблевский а/д мост",
        "Гродно обход а/д мост",
        "Гродно кольцев.а/д мост",
        "Гродно ж/д мост",
        "Гродно (ул.Горновых) а/д мост",
        "Гродно (ул.Поповича) а/д мост"
    ],
}

export const siteRivers = [
    "Неман",
    "Августовский канал",
]

export const sibDistricts = [
    `1. река Днепр(дер.Левки(воздушный переход) - н.п.
    Любеч(граница Белводпуть - Укрводпуть)`,
    `2. река Березина(г.Березино(Березино - пристань) -
    устье реки Березина`,
    `3. река Сож(г.Славгород(Славгород - город) - устье
    реки Сож)`,
    `4. река Неман(деревня Яблоново(вход в затон) -
    граница с Литовской Республикой)`,
    `5. река Мухавец(г.Брест(речной порт Брест) -
    г.Кобрин(слияние реки Мухавец и Днепро-Бугского канала)`,
    `6. Днепро - Бугский канал(г.Кобрин(слияние реки
    Мухавец и Днепро-Бугский канал) - слияние Днепро-Бугский канал и реки Пина)`,
    `7. река Пина(слияние Днепро-Бугский канал и реки Пина - г.Пинск(слияние
    реки Пина и реки Припять) - знак "запрещение прохода")`,
    `8. верхний участок реки Припять(7 км реки Припять -
    г.Пинск, слияние реки Припять и реки Пина)`,
    `9. река Припять(г.Пинск(слияние реки Пина и реки
    Припять) - перекат Усовский-1(граница с
    Украиной))`,
    `10. Микашевичский канал(устье Микашевичского канала -
    речной порт Микашевичи)`,
    `11. река Горынь(перекат Комора-2 - устье реки Горынь)`,
    `12. река Западная Двина(деревня Сураж - Полоцкая
    гидроэлектростанция)`,
    `13. Туровский затон(г.Туров(вход в затон) -
    г.Туров(причал)`,
    `14. Августовский канал(Граница с Республикой Польша - устье
    Августовского канала(слияние с рекой Неман))`,
    `15. река Свислочь(Минская кольцевая автомобильная дорога -
    переулок Канатный)`
]
export const sibOrganizations = [
    "Гродненский участок", 
]