export const ges= [
    { id: 1, name: 'Витебская ГЭС',  year: '2016-2017', river: 'река Западная Двина', power: 40, owner: 'Белэнерго', coords: [55.25153362223599, 30.15994864258706]},
    { id: 2, name: 'Полоцкая ГЭС',  year: '2017', river: 'река Западная Двина', power: 21.6, owner: 'Белэнерго', coords: [55.432824129446296, 28.946897050129326]},
    { id: 3, name: 'Гродненская ГЭС',  year: '2012', river: 'река Неман', power: 17, owner: 'Белэнерго', coords: [53.64524425246265, 23.973369479701983]},
    { id: 4, name: 'ГЭС Немново',  year: '2004', river: 'Августовский канал', power: 0.1, owner: 'Белэнерго', coords: [53.86175072704196, 23.748768988684148]},
    { id: 5, name: 'ГЭС Новосады',  year: '2013', river: 'река Муховец', power: 0.3, owner: 'Днепробугводпуть', coords: [52.08311915, 23.57087108]},
    { id: 6, name: 'ГЭС Залузье',  year: '2011', river: 'река Муховец', power: 0.18, owner: 'Днепробугводпуть', coords: [52.190979076169235, 24.12841961344715]},
    { id: 7, name: 'ГЭС Дубой',  year: '2008', river: 'река Пин', power: 0.11, owner: 'Днепробугводпуть',coords: [52.02253924052849, 25.472331461011795] },
    { id: 8, name: 'Кобрин ГЭС',  year: '2012', river: 'река Муховец', power: 0.2, owner: 'РУЭСП Днепробугводпуть',coords: [52.2119336565074, 24.397060607471715 ] },
    { id: 9, name: 'ГЭС Стахово',  year: '2015', river: 'река Припять', power: 0.63, owner: 'Днепробугводпуть', coords: [52.111088249102814, 26.735589357570852]},
    { id: 10, name: 'ГЭС Дрозды',  year: '2008', river: 'река Свислоч', power: 0.3, owner: 'РУП "Минскводоканал"', coords: [53.9559449816927, 27.382286413366394 ]}
  ]