export const rivers = [
    "Днепр",
    "Березина",
    "Сож",
    "Неман",
    "Мухавец",
    "Днепро-Бугский канал",
    "Пина",
    "Верхний участок реки Припять",
    "Припять",
    "Микашевичский канал",
    "Горынь",
    "Западная Двина",
    "Туровский затон",
    "Августовский канал",
    "Свислочь"
]

export const sites = {
    site1: [
        "1.1 дер.Левки (воздушный переход) – Прудки III",
        "1.2 Прудки III – Могилев (мостовой переход)",
        "1.3 Могилев (мостовой переход) – прк. Стайки III",
        "1.4 прк. Стайки III – Быхов",
        "1.5 Быхов – у.р. Друть",
        "1.6 у.р. Друть – у.р. Березины",
        "1.7 у.р. Березины – прк. Черное I",
        "1.8 прк. Черное I – Речицкий ССРЗ",
        "1.9 Речицкий ССРЗ – прк. Боровая I",
        "1.10 прк. Боровая I – Подречицкое",
        "1.11.1 Подречицкое – 1082 км",
        "1.11.2 1082 км – Каменка ",
        "1.12 Каменка – н.п. Любеч (гр. Белводпуть - Укрводпуть)"
    ],
    site2: [
        "2.1 г.Березино (Березино пристань) – у.р. Волчанки",
        "2.2.1 у.р. Волчанки – прк. Течка",
        "2.2.2 прк. Течка – Бобруйский порт",
        "2.3 Бобруйский порт – прк. Волышино",
        "2.4 прк. Волышино – оз. Сельное",
        "2.5 оз. Сельное – Якимова Слобода IV",
        "2.6 Якимова Слобода IV – устье реки Березина"
    ],
    site3: [
        "3.1 г. Славгород (Славгород - город) – Чечерский а/м мост",
        "3.2.1 Чечерский автомобильный мост - пкр. у.р.Беседь 2",
        "3.2.2 прк. у.р.Беседь 2 - прк. Крысин 1",
        "3.3.1 прк. Крысин 1 – старица \"Боровая\" исток",
        "3.3.2 старица \"Боровая\" исток –  Гомель пристань",
        "3.4 Гомель пристань – порт Осовцы",
        "3.5 порт Осовцы – прк. Никольский 3",
        "3.6.1 прк. Никольский 3 – 35 км",
        "3.6.2 35 км – прк. Карповка 1",
        "3.7 прк. Карповка 1 – устье реки Сож",
    ],
    site4: [
        "4.1 деревня Яблоново (вход в затон) – д. Ковшово",
        "4.2 деревня Ковшово – Гродненская ГЭС",
        "4.3.1 Гродненская ГЭС - прк. Городнянка",
        "4.3.2 прк. Городнянка - граница с Литовской Республикой",
    ],
    site5: [
        "5.1 г. Брест (речной порт Брест) – г/у \"Тришин\"",
        "5.2 г/у \"Тришин\" – г/у \"Новосады\" ",
        "5.3 г/у Новосады – г.Кобрин (слияние р. Мухавец и Днепро-Бугский канал)",
    ],
    site6: [
        "6.1.1 г. Кобрин (слияние р. Мухавец и Днепро-Бугский канал) – г/у 4 Овзичи",
        "6.1.2 г/у 4 Овзичи - слияние Днепро-Бугский канал и р.Пина",
    ],
    site7: [
        "7.1 слияние Днепро-Бугский канал и реки Пина-г/у \"Дубой\"",
        "7.2 г/у \"Дубой\" – порт Пинск",
        "7.3 порт Пинск – г.Пинск (сл. рек Пина и Припять)",
        "7.4 Слияние р.Пина и Припять – знак \"Запрещение прохода\"",
    ],
    site8: [
        "8.1 7 км реки Припять – г.Пинск (слияние рек Пина и Припять)",
    ],
    site9: [
        "9.1 г.Пинск (сл. рр Пина и Припять) – г/у \"Качановичи\"",
        "9.2 г/у \"Качановичи\" – г/у \"Стахово\"",
        "9.3 г/у \"Стахово\" – устье р. Горынь",
        "9.4 устье р. Горынь – устье Микашевичского канала",
        "9.5 устье Микашевичского канала – дер. Балажевичи",
        "9.6.1 дер. Балажевичи – прк. Лучежевичский 1",
        "9.6.2 прк. Лучежевичский 1 – Пховский затон",
        "9.7.1 Пховский затон – затон Кимборовка",
        "9.7.2.1 затон Кимборовка – д. Конотоп",
        "9.7.2.2.1 д.Конотоп-прк.Довлядовское спрямление",
        "9.7.2.2.2 прк.Довлядовское спрямление – прк. Усовский-1 (граница с Украиной)",
    ],
    site10: [
        "10.1 устье Микашевичского канала – р.п. Микашевичи",
    ],
    site11: [
        "11.1 перекат Комора-2 – устье реки Горынь",
    ],
    site12: [
        "12.1 деревня Сураж – д. Круподеры",
        "12.2 д. Круподеры – Витебская ГЭС",
        "12.3 Витебская ГЭС – Витебск (груз.) порт",
        "12.4 Витебск (груз.) порт – д. Слобода",
        "12.5 д. Слобода – г. Бешенковичи",
        "12.6 г. Бешенковичи – прк. Сосница",
        "12.7 прк. Сосница – Полоцкая гидроэлектростанция",
    ],
    site13: [
        "13.1 г. Туров (вход в затон) – г. Туров (причал)",
    ],
    site14: [
        "14.1 Граница с Республикой Польша –16 км Августовского канала",
        "14.2 16 км Августовского канала – устье Августовского канала (слияние с рекой Неман)",
    ],
    site15: [
        "15.1 МКАД – МГЭС (Водохранилище \"Дрозды\")",
        "15.2 МГЭС (в-ще \"Дрозды\") – ул.Орловская (ниж. гр. пляжа)",
        "15.3 ул.Орловская (ниж. гр. пляжа) – пер. Канатный",
    ],
    
}